app/controllers/articles_controller.rb

    def create
 	@article = Article.new(params.require(:article).permit(:title, :text))
        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "c language"], ["text", "easy"], ["created_at", "2019-10-24 13:43:51.727017"], ["updated_at", "2019-10-24 13:43:51.727017"]]